/*
Змінні в js

var - відсутність області видимості , може бути використана до моменту призначення
let - ' є область видимості , не може бути використана до моменту призначення
constant неможливо перепризначити, неможливо створити пустою 

let PascalCase;
let snake_case використовують у базах даних зазвичай 

області видимості 

0 глобальна 
1 функціональна 
2 блочна

якщо змінна створена усередині функції то область видимості функціональна 

const myConst: string = "string";

коли змінна створена а значення не присвоєна то тип даних цієї змінної undefined 

void - пустота нічого не повертає

*/

let colorTable = "white";
let OS = "Window";
let averageScore = 10;
